### REVIEW CLEANING AND TRANSFORMATION

## QUESTION 1

In [1]:
# CONSIDER THE FOLLOWING 

import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas",np.nan],
    'Fee' :[20000,25000,26000,23093,24000,np.nan],
    'Duration':['30day','40days','35days','45days',np.nan,np.nan],
    'Discount':[1000,np.nan,1200,2500,pd.NaT,np.nan],
    '':[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
              }
index_labels=['r1','r2','r3','r4','r5','']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN
        NaN      NaN      NaN      NaN NaN

In [ ]:
# DETECT THE MISSING VALUES. OUTPUT SHOULD BE BOOLEAN VALUES

In [ ]:
# COUNT THE NUMBER OF MISSING VALUES

In [2]:
# DROP ROWS WHERE ALL VALUES ARE MISSING

In [ ]:
# DROP COLUMNS WHERE ALL VALUES ARE MISSING

In [3]:
# REMOVE ROW WITH AT LEAST TWO MISSING VALUES

## QUESTION 2

In [7]:
# DATASET

data = {'A': [1, 2, np.nan, 4, 5],
        'B': ['a', 'b', 'c', np.nan, 'e'],
        'C': [np.nan, 2.5, 3.2, 4.7, 5.1]}
df = pd.DataFrame(data)
df

     A    B    C
0  1.0    a  NaN
1  2.0    b  2.5
2  NaN    c  3.2
3  4.0  NaN  4.7
4  5.0    e  5.1

In [ ]:
# Fill missing values with the mean of the column. When will this tpe of imputation be useful?

In [ ]:
# Fill missing values with the median of the column. When will this type of imputation be useful?

In [ ]:
# Create a sample DataFrame with missing values



# Demonstrate selective replacement of missing values in 2 columns

In [ ]:
# Use ffill() function to fill the missing values along the column axis and limit to 2

### QUESTION 3

In [9]:
# Sample data for student names and ages
students_data = {
    'Name': ["Alice", "Bob", "Charlie", "David", "Alice", "Eva", "Bob"],
    'Age': [20, 22, 21, 23, 20, 19, 22],
    'Grade': [85, 90, 78, 92, 85, 88, 90],
    'Attendance': [95, 92, 88, 93, 95, 96, 92]
}

# Create a DataFrame
students_df = pd.DataFrame(students_data)
print(students_df)

      Name  Age  Grade  Attendance
0    Alice   20     85          95
1      Bob   22     90          92
2  Charlie   21     78          88
3    David   23     92          93
4    Alice   20     85          95
5      Eva   19     88          96
6      Bob   22     90          92

In [ ]:
# Indicate rows that are duplicated
#  Remove all duplicate rows

In [ ]:
# Delete duplicate rows based on specific columns (Name and Age)

In [ ]:
# Use DataFrame.apply() and lambda function to make names case-insensitive and keep the first occurrence

### QUESTION 4

In [ ]:
# create a list of exam scores

In [ ]:
# define the bins - grading ranges, set right to true (default)

In [ ]:
# Label bins

### QUESTION 5

In [20]:
names = pd.Series(["Tim", "Sam", "Tom", "Jane"] * 3)
names

0      Tim
1      Sam
2      Tom
3     Jane
4      Tim
5      Sam
6      Tom
7     Jane
8      Tim
9      Sam
10     Tom
11    Jane
dtype: object

In [ ]:
# Show the unique data values

In [ ]:
# What are the number of duplicate values

In [13]:
# Lenght of the name variable to create a datafrane


n = len(names)
n

12

In [22]:
df_names = pd.DataFrame(
    {"name": names, 
     "num":np.arange(n), 
     "score":np.random.randint(40, 100,
                              size = n),
     "weight" :np.random.uniform(50, 70,
                              size = n)},   
    columns = ['num', 'name', 'score', "weight"])

df_names

    num  name  score     weight
0     0   Tim     50  63.676817
1     1   Sam     64  55.111185
2     2   Tom     53  51.304043
3     3  Jane     40  52.402771
4     4   Tim     80  58.564287
5     5   Sam     52  56.078659
6     6   Tom     72  65.572167
7     7  Jane     98  53.243287
8     8   Tim     79  60.706475
9     9   Sam     68  52.801677
10   10   Tom     62  63.684129
11   11  Jane     80  54.175551

In [ ]:
# Convert column to a category type

In [ ]:
#  take a look at the memory usage of categorical and non-categorical data.

# QUESTION 6

In [27]:
color_data = ['red', 'blue', 'green', 'red', 'blue']
color_data

['red', 'blue', 'green', 'red', 'blue']

In [ ]:
# Create a categorical column

In [28]:
# convert the Series to a categorical Series using .astype()

color_data2 = ['red', 'blue', 'green', 'red', 'blue']
series1 = pd.Series(color_data2)

In [ ]:
#  a categorical Series
data_labels = ['A', 'B', 'A', 'C', 'B']
cat_series = pd.Series(data, dtype="category")

# create a dictionary for renaming categories

In [ ]:
# rename categories using .rename_categories() and recreate the Series

In [ ]:
# add new categories and reassign the variable

In [ ]:
# remove added categories